public class Main {
    public static void main(String[] args) {
        int ticketPrice = 5000;
        int amount = 20;
        int total = ticketPrice / amount;

        System.out.println("Количесво миль = " + total);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}